USE VUZDATABASE
GO

INSERT INTO Свойства VALUES
(1, 'Краткое название'),
(2, 'Полное название'),
(3, 'Город'),
(4, 'Улица'),
(5, 'Номер Дома'),
(6, 'Сайт'),
(7, 'Телефон'),
(8, 'Кабинет'),
(9, 'email'),
(10, 'Факс'),
(11, 'Приемные часы')

INSERT INTO ВУЗ_Свойства VALUES
(1, 'МФТИ'),
(2, 'Московский Физико-Технический Институт'),
(3, 'Долгопрудный'),
(4, 'Институтский переулок'),
(5, '9'),
(6, 'mipt.ru'),
(7, '84954224554')

INSERT INTO Подразделения VALUES
(1, 'Кафедра Высшей Математики'),
(2, 'Кафедра Общей Физики'),
(3, 'Кафедра Теоретической Механики'),
(4, 'Деканат ФОПФ'),
(5, 'Ректорат')

INSERT INTO Подразделение_Свойства VALUES
(1,8, 'ГК331'),
(1,7, '+7 (495) 408-22-81'),
(1,9, 'kvm@nipt.ru'),
(1,10, '1234567'),
(1,11, '13:00-18:00')

INSERT INTO Сотрудники VALUES
(1, 'Иванов Василий Евгеньевич'),
(2, 'Максимычев Валентин Витальевич'),
(3, 'Карасев Николай Николаевич'),
(4, 'Гец Геннадий Вячеславович'),
(5, 'Соколов Василий Викторович'),
(6, 'Константинов Алексей Викторович')

INSERT INTO Свойства_сотрудников VALUES
(1, 'Дата рождения'),
(2, 'Ученая степень'),
(3, 'Ученое звание'),
(4, 'СНИЛС'),
(5, 'Номер паспорта'),
(6, 'Телефон'),
(7, 'email')

INSERT INTO Сотрудники_Свойства VALUES
(1,1, '1968-03-05'),
(1,2, 'Доктор физико-математических наук'),
(1,3, 'Профессор'),
(1,4, '132321'),
(1,5, '3145 386454')

INSERT INTO Должности VALUES
(1,'Ректор',0),
(2,'Декан', 0),
(3,'Секретарь', 1),
(4,'Помощник ректора', 1),
(5,'Зав.кафедрой', 1),
(6,'Зам.декана', 1),
(7,'Преподаватель', 0);

INSERT INTO Ответственные_Должности VALUES
(5,1,6,'+7 (495) 338-77-81'),
(5,1,7,'zavkafkvm@mipt.ru'),
(4,5,6,'+7 (495) 408-57-00'),
(4,5,7,'rektmipt@mipt.ru'),
(5,2,6,'+7 (498) 744-63-20'),
(5,2,7,'zavkafkof@mipt.ru');

INSERT INTO Сотрудник_Должность VALUES
(1,5),
(2,5),
(3,7),
(4,6),
(5,5),
(6,7);

INSERT INTO Предметы VALUES
(1,	1,	'Математический анализ',	18,	18),
(2,	3,	'Аналитическая механика',	16,	20),
(3,	1,	'Дифференциальная геометрия',	16,	10),
(4,	2,	'Электричество и магнетизм',	16,	16),
(5,	1,	'Функциональный анализ',	18,	18);

INSERT INTO Предмет_Преподаватель VALUES
(1,	1),
(1,	3),
(1,	6),
(2,	5),
(3,	3),
(4,	2),
(5,	6);

INSERT INTO Студенты VALUES
(1,	'Петров Андрей Витальевич',		2202,	2021),
(2,	'Заварзина Мария Викторовна',	2202,	2021),
(3,	'Медведев Артем Николаевич',	3201,	2021),
(4,	'Лебедев Виктор Анатольевич',	3201,	2021),
(5,	'Павлов Николай Леонидович',	3103,	2020);

INSERT INTO Статусы VALUES
(1,	'Первый год обучения'),
(2,	'Второй год обучения'),
(3,	'Третий год Обучения'),
(4,	'Четвертый год обучения'),
(5,	'Закончил'),
(6,	'Отчислен'),
(7,	'Академ');

INSERT INTO Статус_Студента VALUES
(1,	3),
(2,	3),
(3,	2),
(4,	5),
(5,	6);

INSERT INTO Факультеты VALUES
(1,	'ФРТК'),
(2,	'ФОПФ'),
(3,	'ФУПМ'),
(4,	'ФИВТ'),
(5,	'ФФКЭ');

INSERT INTO Группы VALUES
(2202,	2),
(2203,  2),
(3201,	3),
(3103,	1),
(1321,	1),
(3213,	5);

INSERT INTO История_обучения VALUES
(1,	1,	'2021-2022',	2202),
(1,	2,	'2021-2022',	2202),
(2,	1,	'2021-2022',	2203),
(2,	2,	'2021-2022',	2202),
(3,	1,	'2021-2022',	3201),
(3,	2,	'2021-2022',	3201),
(4,	1,	'2021-2022',	3201),
(4,	2,	'2021-2022',	3201),
(5,	1,	'2020-2021',	3103),
(5,	2,	'2020-2021',	3103);


INSERT INTO Учебный_план VALUES
(2,	1,	'Экзамен',	1),
(1,	1,	'Экзамен',	1),
(3,	1,	'Экзамен',	1),
(2,	2,	'Зачет',	1),
(3,	2,	'Зачет',	1);

INSERT INTO Расписание VALUES
(1,	2202,	1,	'2021-2022',	1),
(1,	3201,	1,	'2021-2022',	6),
(2,	2202,	1,	'2021-2022',	5),
(4,	2202,	2,	'2021-2022',	2),
(5,	3201,	2,	'2021-2022',	6);


INSERT INTO Ведомости VALUES
(1,	'2021-12-22',	1,	1,	1),
(2,	'2021-12-23',	2,	5,	2),
(3,	'2021-12-23',	2,	2,	1),
(4,	'2022-05-24',	2,	1,	1),
(5,	'2022-05-24',	2,	5,	2);

INSERT INTO Оценки VALUES
(1,	1,	'хор'),
(1,	2,	'хор'),
(2,	1,	'отл'),
(2,	2,	'хор'),
(1,	3,	'уд');

INSERT INTO Успеваемость VALUES
(1,	1,	1,	'Экзамен',	'хор',	1,	'2021-12-22',	1),
(1,	1,	2,	'Экзамен',	'отл',	1,	'2021-12-23',	2),
(2,	1,	1,	'Экзамен',	'хор',	1,	'2021-12-23',	1),
(2,	1,	2,	'Экзамен',	'хор',	1,	'2021-12-23',	2);







